[
  {
    "id": "m1",
    "categoryId": "c1",
    "title": "Chocolate Strawberry Shortcake",
    "image": "assets/images/product/chocolate-strawberry-shortcake.webp",
    "intro": "I like to serve this chocolate strawberry shortcake on Valentine's Day. It's really good and looks nice on the table. I have had this recipe for over 40 years.",
    "ingredients": "2 cups all-purpose flour\n⅓ cup white sugar\n¼ cup cocoa powder\n1 tablespoon baking powder\n1 teaspoon baking soda\n½ teaspoon salt\n½ cup butter\n1 cup milk\n2 pints strawberries, sliced\n¼ cup white sugar\n1 (12 ounce) container frozen whipped topping, thawed\n2 tablespoons chocolate syrup",
    "instructions": "– Preheat the oven to 400 degrees F (200 degrees C). Grease two 9-inch layer pans.\n– In a large mixing bowl, combine flour, 1/3 cup sugar, cocoa, baking powder, baking soda, and salt. Cut in butter until mixture resembles coarse crumbs. Add milk, mixing until just moistened. Spread batter evenly into the prepared layer pans.\n– Bake in the preheated oven for 15 minutes, or until a toothpick inserted in the center comes out clean. Cool.\n– Meanwhile, in a medium mixing bowl, combine strawberries and remaining 1/4 cup sugar. Let mixture stand for 10 minutes.\n– Remove shortcake layers from the pans. Place one layer on a serving plate; cover with 1/2 of the of strawberry mixture and 1/2 of the whipped topping. Place remaining shortcake layer on top, then remaining strawberry mixture and remaining whipped topping. Drizzle chocolate syrup over top.",
    "view": "130",
    "favorite": "67"
  },
  {
    "id": "m2",
    "categoryId": "c1",
    "title": "Black Forest",
    "image": "assets/images/product/black-forest.jpg",
    "intro": "Very delicious and easy to make. Garnish with chocolate curls made by using a cheese grater on semisweet chocolate.",
    "ingredients": "3 cups heavy whipping cream\n4 ½ tablespoons white sugar\n1 ½ teaspoons vanilla extract",
    "instructions": "Beat together cream, sugar, and vanilla in a bowl with an electric mixer until stiff. Place in the refrigerator until set, about 15 minutes.",
    "view": "150",
    "favorite": "122"
  },
  {
    "id": "m3",
    "categoryId": "c1",
    "title": "Tres Leches",
    "image": "assets/images/product/tres-leches.webp",
    "intro": "This delicious tres leches cake features three types of milk: whole milk, condensed milk, and evaporated milk. It's topped with sweet whipped cream. An excellent cake for milk lovers!",
    "ingredients": "1 ½ cups all-purpose flour\n1 teaspoon baking powder\n½ cup unsalted butter\n1 cup white sugar\n5 eggs\n½ teaspoon vanilla extract\n2 cups whole milk\n1 (14 ounce) can sweetened condensed milk\n1 (12 fluid ounce) can evaporated milk\n1 ½ cups heavy whipping cream\n1 cup white sugar\n1 teaspoon vanilla extract",
    "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch baking pan.\nSift flour and baking powder together; set aside.\nBeat sugar and butter together in a large bowl with an electric mixer until light and fluffy. Add eggs and vanilla; beat well. Add flour mixture, about 1/2 cup at a time, mixing until well blended. Pour batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 30 minutes. Pierce cake all over with a fork; let cool to room temperature.\nMix whole milk, condensed milk, and evaporated milk together in a bowl; pour over the top of the cooled cake and allow to soak in.\nWhip cream, remaining 1 cup of sugar, and 1 teaspoon vanilla in a chilled glass or metal bowl with an electric mixer until thick. Spread over the top of the filling. Keep cake refrigerated until serving.",
    "view": "100",
    "favorite": "50"
  },
  {
    "id": "m4",
    "categoryId": "c1",
    "title": "Watermelon Cake",
    "image": "assets/images/product/watermelon-cake.webp",
    "intro": "This fun cake has tender vanilla layers with just the slightest hint of watermelon flavor, all coated in a yummy buttercream.",
    "ingredients": "Cake:\nnonstick baking spray\n2 ½ cups all-purpose flour\n1 tablespoon all-purpose flour\n3 tablespoons watermelon-flavored gelatin mix (such as Jell-O®)\n1 teaspoon baking powder\n1 teaspoon kosher salt\n½ teaspoon baking soda\n1 cup unsalted butter, softened\n2 cups white sugar\n3 large eggs\n1 ½ cups whole buttermilk\n2 teaspoons vanilla extract\n1 teaspoon red gel food coloring\n1 cup miniature semisweet chocolate chips\nFrosting:\n1 ½ cups unsalted butter, softened\n¼ teaspoon kosher salt\n2 teaspoons vanilla extract\n6 cups powdered sugar\n6 tablespoons heavy whipping cream\nred food coloring gel\ngreen food coloring gel\nminiature semisweet chocolate chips for decoration",
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat three 8-inch round cake pans with baking spray; set aside.\nWhisk together 2 1/2 cups flour, gelatin, baking powder, salt, and baking soda in a medium bowl. Beat butter at medium speed with a stand mixer, fitted with the paddle attachment, until creamy, about 3 minutes. Gradually add sugar, beating until light and fluffy, 3 to 4 minutes. Add eggs, 1 at a time, beating just until blended and stopping to scrape down sides of bowl after each addition.\nAdd flour mixture to butter mixture alternately with buttermilk, beginning and ending with flour mixture, beating at low speed until just blended after each addition. Beat in vanilla and red food coloring gel until blended. Toss chocolate chips with remaining 1 tablespoon flour in a small bowl. Gently fold into batter.\nDivide batter evenly among prepared cake pans.\nBake in the preheated oven until a wooden pick inserted in the center comes out clean, 28 to 32 minutes. Cool in pans on a wire rack for 10 minutes. Remove cakes from pans and cool completely on wire rack about 1 hour.\nPrepare Frosting: Beat butter and salt with a stand mixer fitted with a paddle attachment on medium speed until creamy, about 3 minutes; beat in vanilla. Gradually add powdered sugar alternately with 6 tablespoons cream, beating on low speed, until completely incorporated and smooth, about 2 minutes. Increase mixer speed to medium-high and beat until mixture is smooth and fluffy, about 2 to 3 minutes. Remove 1/3 cup of the frosting to a small bowl. Remove 2 cups of the frosting to a medium bowl; stir in enough red food coloring until desired shade of red. Tint remaining frosting with green food coloring gel until desired shade of green.\nAssemble Cake: Place 1 cake layer on a serving platter or cake stand. Spread top with 2/3 cup red frosting. Top with a second cake layer; spread top with 2/3 cup red frosting. Top with remaining cake layer; spread top with remaining red frosting, leaving a 1/2-inch border around edge. Frost sides of cake with green frosting. Place reserved 1/3 cup plain frosting into a piping bag or zip-lock bag with a 1/4-inch hole cut in the corner. Pipe plain frosting around top edge of cake, filling in the 1/4-inch border. Sprinkle top with miniature chocolate chips to resemble seeds.",
    "view": "140",
    "favorite": "88"
  },
  {
    "id": "m5",
    "categoryId": "c1",
    "title": "Buche de Noel",
    "image": "assets/images/product/buche-de-noel.webp",
    "intro": "Buche de Noel is the French name for a Christmas cake shaped like a log. This one is a heavenly flourless chocolate cake rolled with chocolate whipped cream and decorated with confectioners' sugar to resemble snow on a yule log. It doesn't just look beautiful — it tastes wonderful, too!",
    "ingredients": "2 cups heavy cream\n½ cup confectioners' sugar\n½ cup unsweetened cocoa powder\n1 teaspoon vanilla extract\n6 egg yolks\n½ cup white sugar\n⅓ cup unsweetened cocoa powder\n1 ½ teaspoons vanilla extract\n⅛ teaspoon salt\n6 egg whites\n¼ cup white sugar\nconfectioners' sugar for dusting",
    "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a 10x15 inch jellyroll pan with parchment paper. In a large bowl, whip cream, 1/2 cup confectioners' sugar, 1/2 cup cocoa, and 1 teaspoon vanilla until thick and stiff. Refrigerate.\nIn a large bowl, use an electric mixer to beat egg yolks with 1/2 cup sugar until pale in color, light and frothy. Blend in 1/3 cup cocoa, 1 1/2 teaspoons vanilla, and salt. In large glass bowl, using clean beaters, whip egg whites to soft peaks. Gradually add 1/4 cup sugar, and beat until whites form stiff peaks. Immediately fold the yolk mixture into the whites. Spread the batter evenly into the prepared pan.\nBake for 12 to 15 minutes in the preheated oven, or until the cake springs back when lightly touched. Dust a clean dishtowel with confectioners' sugar. Run a knife around the edge of the pan, and turn the warm cake out onto the towel. Remove and discard parchment paper. Starting at the short edge of the cake, roll the cake up with the towel. Cool for 30 minutes.\nUnroll the cake, and spread the filling to within 1 inch of the edge. Roll the cake up with the filling inside. Place seam side down onto a serving plate, and refrigerate until serving. Dust with confectioners' sugar before serving.",
    "view": "223",
    "favorite": "130"
  },
  {
    "id": "m6",
    "categoryId": "c2",
    "title": "Chocolate Truffle Cookies",
    "image": "assets/images/product/chocolate-truffle-cake.webp",
    "intro": "A very dark, rich chocolate cookie for the true chocoholic. This recipe uses relatively little flour, resulting in dense, fudge-like cookies. These cookies keep well in the freezer (but you may have a hard time waiting for them to thaw before you eat them).",
    "ingredients": "4 (1 ounce) squares unsweetened chocolate, chopped\n1 cup semisweet chocolate chips\n6 tablespoons butter\n3 eggs\n1 cup white sugar\n1 ½ teaspoons vanilla extract\n½ cup all-purpose flour\n2 tablespoons unsweetened cocoa powder\n¼ teaspoon baking powder\n¼ teaspoon salt\n1 cup semisweet chocolate chips",
    "instructions": "In the microwave or in a metal bowl over a pan of simmering water, melt unsweetened chocolate, 1 cup of the chocolate chips, and the butter stirring occasionally until smooth. Remove from heat and set aside to cool. In a large bowl, whip eggs and sugar until thick and pale, about 2 minutes. Stir in the vanilla and the chocolate mixture until well mixed. Combine the flour, cocoa, baking powder and salt; gradually stir into the chocolate mixture. Fold in remaining 1 cup chocolate chips. Cover dough and chill for at least an hour or overnight.\nPreheat oven to 350 degrees F (175 degrees C). Roll chilled dough into 1 inch balls. Place on ungreased cookie sheets so they are 2 inches apart.\nBake for 9 to 11 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.",
    "view": "180",
    "favorite": "60"
  },
  {
    "id": "m7",
    "categoryId": "c2",
    "title": "Paul's Pumpkin Bars",
    "image": "assets/images/product/pauls-pumpkin-bars.webp",
    "intro": "These easy pumpkin bars are full of fall flavor with a moist texture and a decadent cream cheese frosting. So far, I haven't found anyone who doesn't love them!",
    "ingredients": "Cake:\n1 (15 ounce) can pumpkin puree\n1 ⅔ cups white sugar\n1 cup vegetable oil\n4 large eggs\n2 cups all-purpose flour\n2 teaspoons ground cinnamon\n2 teaspoons baking powder\n1 teaspoon baking soda\n1 teaspoon salt\nFrosting:\n½ cup butter, softened\n1 (3 ounce) package cream cheese, softened\n1 teaspoon vanilla extract\n2 cups sifted confectioners' sugar",
    "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nMake cake: Beat pumpkin, sugar, oil, and eggs with an electric mixer in a medium bowl until well combined.\nSift together flour, cinnamon, baking powder, baking soda, and salt in a separate bowl; stir into pumpkin mixture until thoroughly combined. Spread batter evenly into an ungreased 10x15-inch jelly roll pan.\nBake in the preheated oven until cake bounces back when gently pressed, 25 to 30 minutes. Remove from the oven and let cool.\nWhile the cake is cooling, make frosting: Beat together butter and cream cheese until smooth; stir in vanilla. Add confectioners' sugar a little at a time, beating until mixture is smooth.\nSpread frosting evenly on top of cooled cake. Cut into 24 squares.",
    "view": "155",
    "favorite": "54"
  },
  {
    "id": "m8",
    "categoryId": "c2",
    "title": "Cranberry Orange Cookies",
    "image": "assets/images/product/cranberry-orange-cake.webp",
    "intro": "These cranberry orange cookies are nice to have during the holidays, but don't expect them to stay around long. These orange-flavored cranberry cookies are tart and delicious, not to mention beautiful. Not really a favorite of kids.",
    "ingredients": "Cookies:\n1 cup unsalted butter, softened\n1 cup white sugar\n½ cup packed brown sugar\n1 large egg\n2 tablespoons orange juice\n1 teaspoon grated orange zest\n2 ½ cups all-purpose flour\n½ teaspoon baking soda\n½ teaspoon salt\n2 cups chopped cranberries\n½ cup chopped walnuts (Optional)\nGlaze:\n1 ½ cups confectioners' sugar\n3 tablespoons orange juice\n½ teaspoon grated orange zest",
    "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nMake the cookies: Cream butter, white sugar, and brown sugar in a mixing bowl until smooth. Beat in egg until well blended. Mix in orange juice and zest.\nWhisk together flour, baking soda, and salt in a separate bowl. Stir flour mixture into the butter mixture until combined. Mix in cranberries and walnuts until evenly distributed.\nDrop dough by rounded tablespoonfuls 2 inches apart onto ungreased cookie sheets.\nBake in the preheated oven, switching racks halfway through, until edges are golden, 12 to 14 minutes. Transfer cookies to wire racks to cool completely.\nMeanwhile, make the glaze: Mix together confectioners' sugar, orange juice, and zest in a small bowl until smooth.\nSpread glaze over the tops of the cooled cookies; let stand until set.",
    "view": "200",
    "favorite": "130"
  },
  {
    "id": "m9",
    "categoryId": "c2",
    "title": "Chef John's Lemon Bars",
    "image": "assets/images/product/chef-johns-lemon-bars.webp",
    "intro": "This is one of my favorite cookies of all time, although technically they're closer to a pie than a cookie. Nothing prepares you for that intense, awesome sweet-tart lemon flavor and custard, perfectly contrasted against that crisp, sweet buttery shortbread cookie.",
    "ingredients": "For the shortbread crust:\n1 cup all-purpose flour\n½ cup unsalted butter at room temperature\n¼ cup confectioners' sugar\n¼ teaspoon vanilla extract\n¼ teaspoon salt\nFor the lemon layer:\n2 large eggs\n1 large egg yolk\n1 cup white sugar\n2 tablespoons all-purpose flour\n¼ cup freshly squeezed lemon juice\n1 tablespoon freshly grated lemon zest\n1 teaspoon confectioners' sugar, or to taste",
    "instructions": "Place an oven rack into middle position in oven and preheat oven to 350 degrees F (175 degrees C). Lightly oil an 8x8-inch baking dish.\nPlace 1 cup flour and butter in a mixing bowl and mash with the back of a spatula or wooden spoon until thoroughly combined. Mix in 1/4 cup confectioners' sugar, vanilla extract, and salt; mash mixture together until mixture looks like a slightly crumbly cookie dough.\nMoisten your fingers with a little water and press dough into bottom of prepared baking dish. Use a fork to prick holes all over the crust.\nBake crust on center rack in the preheated oven until crust edges are barely golden brown, 22 minutes.\nBeat eggs and egg yolks together in a bowl; whisk in white sugar and 2 tablespoons flour until smooth. Add lemon juice and lemon zest; whisk for 2 minutes. Pour lemon custard over crust.\nBake on center rack until custard is set and top has a thin white sugary crust, 25 minutes. Let cool completely before cutting into bars. Dip knife into very hot water, run around the edge, and cut into 16 squares. Dust cookies with 1 teaspoon confectioners' sugar.",
    "view": "320",
    "favorite": "200"
  },
  {
    "id": "m10",
    "categoryId": "c2",
    "title": "Chocolate Chocolate Chip Cookies",
    "image": "assets/images/product/chocolate-chocolate-chip-cookies.webp",
    "intro": "These chocolate chocolate chip cookies are made with cocoa powder and chocolate chips to guarantee chocolaty flavor in every bite. My kids love them!",
    "ingredients": "1 ½ cups white sugar\n1 cup butter, softened\n2 eggs\n2 teaspoons vanilla extract\n2 cups all-purpose flour\n⅔ cup cocoa powder\n¾ teaspoon baking soda\n¼ teaspoon salt\n2 cups semisweet chocolate chips\n½ cup chopped walnuts (Optional)",
    "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nBeat sugar, butter, eggs, and vanilla in a large bowl until light and fluffy.\nCombine flour, cocoa powder, baking soda, and salt in another bowl; stir into butter mixture until well blended. Mix in chocolate chips and walnuts. Drop spoonfuls of dough 2 inches apart onto ungreased cookie sheets.\nBake in the preheated oven just until set, 8 to 10 minutes. Cool slightly on the cookie sheets before transferring to wire racks to cool completely.",
    "view": "120",
    "favorite": "44"
  },
  {
    "id": "m11",
    "categoryId": "c3",
    "title": "Strawberry Hand Pies",
    "image": "assets/images/product/strawberry-hand-pies.webp",
    "intro": "Easy to make when you use pre-made crust, but fill them with your homemade pie filling for that classic strawberry pie flavor.",
    "ingredients": "1 ½ cups diced fresh strawberries\n1 tablespoon sugar\n2 teaspoons cornstarch\n½ teaspoon vanilla extract\n1 (14.1 ounce) package pastry for a 9 inch double crust pie\n1 large egg, beaten\n1 teaspoon confectioners' sugar (Optional)",
    "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nCombine strawberries, sugar, cornstarch, and vanilla extract in a bowl; set aside and let the strawberries macerate.\nLay the 2 pie crusts on a large floured work surface. Roll the crusts out to about 12 inches, and using a knife or pizza cutter, cut 4 sides of the circles to form 2 squares. Cut each square into three equal rectangles so you have a total of 6 rectangles. Using a slotted spoon, place 2 tablespoons of the strawberry mixture on one half of the long ends of the rectangle, but don't spread all the way to the edge.\nBrush beaten egg around the sides of the strips, and then fold the dry end over the strawberry mixture end. Using a fork, gently press the edges together to seal really well, and cut a couple slits in the top of each pie to allow steam to escape.\nBrush the tops of the hand pies with the remaining egg and set hand pies onto the prepared baking sheet.\nBake in the preheated oven until golden brown, 13 to 15 minutes. Remove the pies to a wire rack to cool and dust with confectioners' sugar, if using. Serve warm or at room temperature.",
    "view": "123",
    "favorite": "34"
  },
  {
    "id": "m12",
    "categoryId": "c3",
    "title": "Neapolitan Whoopie Pies",
    "image": "assets/images/product/nepolitan-whoopie-pies.webp",
    "intro": "Not knowing what to do with some strawberry cake mix, and not wanting to make a boring cake, I came up with this recipe using some other odds and ends in my kitchen. Not only was it surprisingly tasty... it was surprisingly quick as well!",
    "ingredients": "1 (15.25 ounce) package strawberry cake mix\n⅓ cup vegetable oil\n2 large eggs\n½ (8 ounce) container whipped topping (such as Cool Whip®)\n½ cup crushed chocolate sandwich cookies (such as Oreo®)",
    "instructions": "Preheat the oven to 275 degrees F (135 degrees C).\nCombine cake mix, vegetable oil, and eggs in a large bowl.\nForm dough into eighteen 1-inch balls and place on a cookie sheet. Flatten each ball with the palm of your hand.\nBake in the preheated oven until edges are golden, about 6 to 8 minutes. Cool on the baking sheet briefly before removing to a wire rack to cool completely, about 15 minutes.\nAdd whipped topping to one side of each cookie, working in pairs. Sprinkle 1/2 of the cookies with crushed Oreos®, then sandwich with remaining cookies. Wrap each whoopie pie with plastic wrap and place in a 1-gallon freezer bag.\nFreeze for at least 1 hour before serving.",
    "view": "200",
    "favorite": "140"
  },
  {
    "id": "m13",
    "categoryId": "c4",
    "title": "Fresh Fruit Frangipane Tart",
    "image": "assets/images/product/fresh-fruit-frangipane-tart.webp",
    "intro": "Now you can have your cake and eat pie too. Halfway between Cake Town and Pieville, there's a little spot called Frangipane Junction where almond cake and flaky buttery pastry merge to show off your favorite summer fruits in the most impressive fashion! Make this easy frangipane tart recipe and bring it to a picnic. Your friends will ask what bakery you went to. Garnish with creme fraiche and lime zest.",
    "ingredients": "For the Tart:\n3 puff pastry rectangles\nFor the Filling:\n1 ½ tablespoons butter, softened\n⅓ cup white sugar\n1 tablespoon white sugar\n1 large egg\n¾ cup almond flour\n¼ teaspoon fine salt\n⅛ teaspoon vanilla extract\n¼ teaspoon almond extract (Optional)\n3 pluots, or to taste\nFor the Glaze:\n3 tablespoons apricot jam (Optional)\n2 teaspoons water (Optional)",
    "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nPlace 1 piece of puff pastry on a baking sheet lined with a silicone mat or parchment paper. Lightly moisten one of the short edges with water. Connect the end of other puff pastry to the moistened edge. Press pieces together to form a long rectangle, trimming off loose ends with a dough scraper as needed.\nCut third puff pastry piece lengthwise into 1-inch strips. Moisten the outer edges of the long rectangle with your finger; stick pastry strips on top. Poke shallow holes all over bottom of dough using a fork. Do not prick the raised border.\nBake pastry shell in the preheated oven until it starts to turn golden brown, about 15 minutes. Remove from oven. Reduce oven temperature to 375 degrees F (190 degrees C). Readjust the borders and push the bottom down with the flat side of a fork. Let cool completely while preparing filling.\nPlace butter and 1/3 cup plus 1 tablespoon sugar in a bowl; smear together using a spatula until combined. Whisk in egg until mixture is creamy. Add almond flour, salt, vanilla extract, and almond extract. Mix thoroughly. Cut each pluot into 6 wedges. Fill pastry shell with almond paste. Stick pluots snugly, but not too deeply, into filling.\nBake in the preheated oven until browned and almond filling is set, 30 to 40 minutes. Transfer tart onto a wire rack and let cool completely, at least 40 minutes.\nCombine apricot jam and water in a microwave-safe bowl. Bring to a boil in the microwave. Let cool until warm. Brush glaze over cooled tart.",
    "view": "330",
    "favorite": "200"
  },
  {
    "id": "m14",
    "categoryId": "c4",
    "title": "Apple Tartlets",
    "image": "assets/images/product/apple-tarlets.webp",
    "intro": "This is one of my fall favorite quick recipes to use those lovely little red apples my backyard tree provides! It's beautiful but also tasty - a great treat or dessert to make for company or bring to a party.",
    "ingredients": "1 (17.5 ounce) package frozen puff pastry, thawed\n6 red apples, thinly sliced\n½ cup lemonade\n12 pats unsalted butter\n½ cup superfine sugar\n½ cup apricot preserves\n1 pinch coarse sugar crystals, or as needed",
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCut puff pastry into 12 equally-sized squares and arrange on a baking sheet.\nDip apple slices in lemonade and place diagonally onto each puff pastry square; top each with 1 pat butter. Sprinkle superfine sugar over each square.\nBake in the preheated oven until tartlet edges are golden, about 12 minutes.\nBring apricot jam to boil a saucepan; cook and stir until jam is thinned, 1 to 2 minutes. Brush jam onto warm tartlets; sprinkle each with sugar crystals.",
    "view": "222",
    "favorite": "33"
  },
  {
    "id": "m15",
    "categoryId": "c4",
    "title": "Strawberry Napoleons",
    "image": "assets/images/product/strawberry-napoleons.webp",
    "intro": "This delicious, attractive, and (most importantly) super-easy puff pastry recipe can easily be made low-fat by using fat-free whipped topping and skim milk. This recipe should be enjoyed the same day for best results. Enjoy!",
    "ingredients": "1 (3.5 ounce) package instant vanilla pudding and pie filling\n1 cup cold 2% milk\n1 ½ cups non-dairy whipped topping, thawed\n½ (17.25 ounce) package frozen puff pastry, thawed\n1 pint fresh strawberries, thinly sliced\n¼ cup confectioners' sugar",
    "instructions": "Preheat oven to 400 degrees F (200 degrees C). Combine pudding mix and cold milk; fold in whipped topping. Refrigerate until ready to use.\nUnfold pastry on a cool, lightly floured surface. Cut into 3 strips along fold marks, then cut each strip into four equal pieces. Place 2 inches apart on a baking sheet.\nBake for 15 minutes in the preheated oven, or until golden brown. Remove from baking sheet, and cool.\nSplit pastries into 2 layers, setting the 8 best looking tops aside. Spread 8 bottom layers with dollops of the pudding mixture. Top each with a layer of strawberries, a small amount of pudding, and another pastry layer. (A small amount of the pudding mix on top of the berries will help keep the layers together.) Spread with remaining pudding mixture and strawberries, and top with remaining pastry layers (the best looking ones). Sprinkle with confectioner's sugar.",
    "view": "44",
    "favorite": "10"
  },
  {
    "id": "m16",
    "categoryId": "c4",
    "title": "Lemon Berry Tartlets",
    "image": "assets/images/product/lemon-berry-tartlets.webp",
    "intro": "This recipe is more about the technique for making little puff pastry tart shells. Fill with lemon curd, chocolate mousse, or whipped cream.",
    "ingredients": "1 sheet frozen puff pastry\n1 tablespoon all-purpose flour for dusting\n1 egg, beaten\n⅓ cup lemon curd\n12 fresh blackberries\n1 tablespoon confectioners' sugar for dusting",
    "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper or a silicone baking mat.\nPlace frozen puff pastry sheet on a work surface dusted with flour. Allow to thaw for 2 to 3 minutes. Using a 1 1/2 to 2-inch round cookie or biscuit cutter, cut out 12 round pieces. Place pastry rounds on the prepared baking sheet. Using a slightly smaller round cookie or biscuit cutter, cut out inner circles in each pastry round, leaving them in place. Brush each pastry round with beaten egg.\nBake in the preheated oven until browned and puffed, 13 to 15 minutes. Allow to cool completely before filling.\nCut around the small inner circle of each pastry round and gently push it down. Fill each tartlet with lemon curd and top with a blackberry. Dust with confectioners' sugar.",
    "view": "223",
    "favorite": "221"
  },
  {
    "id": "m17",
    "categoryId": "c4",
    "title": "Strawberry Kiwi Tartlets",
    "image": "assets/images/product/strawberry-kiwi-tartlets.webp",
    "intro": "Glazed strawberries in puff pastry shells, topped with kiwi sauce and home made whipped cream. I always see strawberry and kiwi paired together in drink mixes and candies. I wanted to make something that used the actual fruits together. This worked perfectly. Rave reviews!",
    "ingredients": "1 egg\n2 teaspoons water\n12 frozen puff pastry shells, thawed\n⅓ cup strawberry preserves\n2 pints fresh strawberries, sliced\n4 kiwis, peeled and seeded\n2 tablespoons honey\n½ cup heavy cream\n2 teaspoons confectioners' sugar",
    "instructions": "Beat together the egg and water in a bowl. Brush the puff pastry shells with the egg mixture, and bake shells according to package directions.\nMelt the preserves in a saucepan over low heat. Remove from heat, and stir in the strawberry slices.\nIn a food processor, blend the kiwis and honey until smooth. In a large bowl, beat together the cream and sugar until stiff peaks form.\nFill each puff pastry shell with strawberries, drizzle with kiwi sauce, and top with whipped cream to serve.",
    "view": "333",
    "favorite": "45"
  },
  {
    "id": "m18",
    "categoryId": "c5",
    "title": "Caramel Candies",
    "image": "assets/images/product/caramel-candies.webp",
    "intro": "These caramels are made with brown sugar, cream, butter and corn syrup and flavored with a hint of vanilla.",
    "ingredients": "1 ¼ cups brown sugar\n1 ⅔ cups white sugar\n1 cup butter\n1 cup corn syrup\n1 ¼ cups heavy cream\n¾ cup whole milk\n2 teaspoons vanilla extract",
    "instructions": "Combine brown sugar, white sugar, butter, corn syrup, cream, milk and vanilla in a medium saucepan over medium heat. Heat, stirring occasionally, to 250 to 265 degrees F (121 to 129 degrees C), or until a small amount of syrup dropped into cold water forms a rigid ball. Pour into an 8x8 inch pan. Let cool before cutting.",
    "view": "189",
    "favorite": "80"
  },
  {
    "id": "m19",
    "categoryId": "c5",
    "title": "Candy Cane Fudge",
    "image": "assets/images/product/candy-cane-fudge.webp",
    "intro": "This peppermint fudge is simple to make, festive, and irresistible! A platter was brought to a cookie trade and was gone so quickly!",
    "ingredients": "nonstick cooking spray\n2 (10 ounce) packages vanilla baking chips\n1 (14 ounce) can sweetened condensed milk\n1 ½ cups crushed candy canes\n½ teaspoon peppermint extract\n1 dash red or green food coloring",
    "instructions": "Line an 8-inch square baking pan with aluminum foil; spray with nonstick spray and set aside.\nCombine vanilla chips and sweetened condensed milk in a saucepan over medium heat. Stir frequently until chips are almost melted; remove from heat and continue to stir until smooth. Stir in candy canes, peppermint extract, and food coloring.\nSpread evenly in the bottom of the prepared pan. Chill for 2 hours, then cut into squares.",
    "view": "190",
    "favorite": "88"
  },
  {
    "id": "m20",
    "categoryId": "c5",
    "title": "Peppermint Bark",
    "image": "assets/images/product/peppermint-bark.webp",
    "intro": "Milk chocolate and white chocolate make this a sweet treat for anyone. Great for the holidays and care packages.",
    "ingredients": "8 ounces high-quality semisweet chocolate, broken into pieces\n2 teaspoons canola oil, divided\n½ teaspoon peppermint extract, divided\n8 ounces high-quality white chocolate, broken into pieces\n25 peppermint candies, crushed, divided",
    "instructions": "Lightly grease a 9-inch square pan. Line the pan with waxed paper, smoothing out any wrinkles.\nCombine semisweet chocolate and 1 teaspoon canola oil in the top of a double boiler over just barely simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted. Remove from the heat and stir in 1/4 teaspoon peppermint extract.\nPour melted chocolate into the prepared pan, and spread evenly to cover the bottom. Sprinkle 1/2 of the crushed candy over the chocolate and refrigerate until completely hardened, about 1 hour.\nCombine white chocolate and remaining 1 teaspoon canola oil in the top of a double boiler over just barely simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until white chocolate is melted. Remove from the heat and stir in remaining 1/4 teaspoon peppermint extract.\nPour melted white chocolate into the pan, directly over the hardened chocolate layer; spread evenly. Sprinkle the remaining crushed candy over top and gently press in. Refrigerate until completely hardened, about 1 hour.\nRemove from the pan and break into small pieces to serve.",
    "view": "134",
    "favorite": "45"
  },
  {
    "id": "m21",
    "categoryId": "c5",
    "title": "Hard Rock Candy",
    "image": "assets/images/product/hard-rock-candy.webp",
    "intro": "Try this rock candy recipe for spicy, cinnamon-flavored hard candy. Wrap pieces in decorative bags for stocking stuffers. Store in an airtight container.",
    "ingredients": "1 cup confectioners' sugar\n3 ¾ cups white sugar\n1 ½ cups light corn syrup\n1 cup water\n2 teaspoons cinnamon oil\n1 teaspoon red food coloring",
    "instructions": "Roll the edges of two 16-inch squares of heavy-duty aluminum foil to form a rim around the outside. Generously sprinkle confectioners' sugar onto each square.\nHeat sugar, corn syrup, and water in a large, heavy saucepan over medium-high heat, stirring constantly, until sugar dissolves and mixture is boiling, about 5 minutes. Stop stirring and boil until a candy thermometer reads 300 to 310 degrees F (149 to 154 degrees C), about 25 minutes.\nRemove from the heat and stir in cinnamon oil and food coloring. Pour hot mixture onto the prepared foil and allow to cool and harden, about 45 minutes. Crack cooled candy into pieces.",
    "view": "190",
    "favorite": "98"
  },
  {
    "id": "m22",
    "categoryId": "c6",
    "title": "Panna Cotta",
    "image": "assets/images/product/panna-cotta.webp",
    "intro": "Panna cotta is a traditional, easy, and delicious Italian custard. I had a difficult time finding a good, simple recipe on the Internet, so I made up my own recipe. It tastes just like the panna cotta served at Italian restaurants. Serve with warm hot fudge sauce and fresh raspberries on top. This keeps well for several days in the refrigerator.",
    "ingredients": "⅓ cup skim milk\n1 (.25 ounce) envelope unflavored gelatin\n2 ½ cups heavy cream\n½ cup white sugar\n1 ½ teaspoons vanilla extract",
    "instructions": "Pour milk into a small bowl. Sprinkle gelatin powder over milk and stir until combined. Set aside.\nStir heavy cream and sugar together in a saucepan. Set over medium heat and bring to a boil; watch carefully as the cream can quickly bubble up and boil over.\nImmediately stir gelatin mixture into boiling cream, stirring until completely dissolved. Cook and stir for 1 minute.\nRemove the pan from the heat and stir in vanilla.\nPour cream mixture into 6 individual ramekins. Leave to cool, uncovered, until no longer warm, about 20 minutes.\nWhen cool, cover with plastic wrap. Refrigerate until set, at least 4 hours but preferably overnight.",
    "view": "321",
    "favorite": "300"
  },
  {
    "id": "m23",
    "categoryId": "c6",
    "title": "ABC Pudding - Avocado, Banana, Chocolate Delight",
    "image": "assets/images/product/abc-pudding-avocado-banana-chocolate-delight.webp",
    "intro": "The avocado is what makes this raw vegan pudding deliciously thick and creamy - It's taste is unnoticeable.",
    "ingredients": "1 ripe avocado, peeled and pitted\n4 very ripe bananas\n¼ cup unsweetened cocoa powder, plus more for garnish",
    "instructions": "Place avocados, bananas, and cocoa powder in a blender; puree until smooth.\nPour pudding into serving bowls and sprinkle additional cocoa powder on top for garnish.\nChill in refrigerator for texture and flavor to develop, at least 1 hour.",
    "view": "334",
    "favorite": "120"
  },
  {
    "id": "m24",
    "categoryId": "c6",
    "title": "Avocado Dessert",
    "image": "assets/images/product/avocado-dessert.webp",
    "intro": "This is an avocado whip my mum makes. Give it a shot! All my friends were apprehensive at first, but then loved it when they tried it.",
    "ingredients": "1 avocado, peeled and pitted\n½ cup milk\n¼ cup white sugar\n½ teaspoon vanilla extract",
    "instructions": "Mash avocado with an electric mixer, or use a food processor. Blend in the milk, sugar and vanilla until smooth. Chill for about 20 minutes before serving.",
    "view": "210",
    "favorite": "120"
  },
  {
    "id": "m25",
    "categoryId": "c6",
    "title": "Homemade Banana Pudding",
    "image": "assets/images/product/banana-pudding.webp",
    "intro": "This homemade banana pudding recipe from scratch was handed down from my grandmother. My whole family loves it and we all grew up on it. Hope you enjoy it!",
    "ingredients": "⅔ cup white sugar\n⅓ cup all-purpose flour\n¼ teaspoon salt\n3 eggs, beaten\n2 cups milk\n2 tablespoons butter, softened\n½ teaspoon vanilla extract\n2 bananas, peeled and sliced\n½ (12 ounce) package vanilla wafer cookies",
    "instructions": "Combine sugar, flour, and salt together in a medium saucepan. Add eggs and stir well. Stir in milk, and cook over low heat, stirring constantly.\nWhen the mixture has thickened enough to coat the back of a metal spoon, remove from heat and continue to stir, cooling slightly. Stir in butter and vanilla until smooth.\nLayer pudding with bananas and vanilla wafers in a serving dish. Chill at least 1 hour in the refrigerator before serving.",
    "view": "112",
    "favorite": "90"
  },
  {
    "id": "m26",
    "categoryId": "c6",
    "title": "Almond Strawberry Chia Seed Pudding",
    "image": "assets/images/product/almond-strawberry-chia-seed-pudding.webp",
    "intro": "This is a very quick pudding recipe with chia seeds. No cooking, no fuss, my kind of recipe in the summer. I add strawberry puree, raspberry puree, etc., depending on the availability of fresh fruit.",
    "ingredients": "2 cups almond milk\n1 (16 ounce) package fresh strawberries, hulled\n½ cup chia seeds\n¼ cup honey\n1 teaspoon vanilla extract",
    "instructions": "Puree almond milk and strawberries in a blender until smooth; pour into a bowl. Stir chia seeds, honey, and vanilla extract into the strawberry puree.\nCover bowl with plastic wrap and refrigerate until set, about 4 hours.",
    "view": "124",
    "favorite": "45"
  },
  {
    "id": "m27",
    "categoryId": "c6",
    "title": "Chef John's Classic Rice Pudding",
    "image": "assets/images/product/chef-johns-classic-rice-pudding.webp",
    "intro": "For whatever reason, rice pudding is usually not near the top when people list their favorite desserts, but despite that, it's a proven crowd-pleaser, and quite easy to make, especially using this simplified, one-pot method.",
    "ingredients": "½ cup uncooked long-grain white rice\n¼ teaspoon kosher salt\n1 cup water\n¼ cup white sugar\n1 ⅓ cups milk\n½ teaspoon vanilla extract\n⅛ teaspoon ground cinnamon\n1 large egg yolk\n1 tablespoon cold butter\n2 tablespoons dried cherries, chopped",
    "instructions": "Place rice, salt, and water into a saucepan. Bring to a boil over medium-high heat. Reduce heat to low, cover, and cook until tender, about 20 minutes. Remove from heat; sprinkle with sugar and pour in milk. Stir with a whisk until until the thin layer of cooked-on starch at the bottom of the pan is cleared and incorporated into the mixture, 2 or 3 minutes.\nPlace pan over medium heat, stirring frequently, until it reaches your desired of level of doneness and creaminess, 8 to 10 minutes. The longer it cooks, the thicker and stickier it will be. Remove from heat. Add vanilla and cinnamon. Very quickly whisk in the egg yolk (to prevent it from cooking). Whisk for about 1 more minute. Add butter and dried cherries; stir thoroughly.\nTransfer warm pudding to serving dishes. Cool to room temperature. Cover and refrigerate until thoroughly chilled, 3 to 4 hours.",
    "view": "215",
    "favorite": "56"
  },
  {
    "id": "m28",
    "categoryId": "c6",
    "title": "Homemade Vanilla Pudding",
    "image": "assets/images/product/homemade-vanilla-pudding.webp",
    "intro": "This rich homemade pudding with vanilla is a delectable dessert. There is no substitute for the butter!",
    "ingredients": "2 cups milk\n½ cup white sugar\n3 tablespoons cornstarch\n¼ teaspoon salt\n1 teaspoon vanilla extract\n1 tablespoon butter",
    "instructions": "Heat milk in a medium saucepan over medium heat until bubbles form at the edges.\nMix sugar, cornstarch, and salt together in a small bowl; add to hot milk, a little at a time, stirring until thick enough to coat the back of the spoon. Remove saucepan from heat, and stir in vanilla and butter.\nSpoon pudding evenly into 5 serving dishes; chill in the refrigerator before serving.",
    "view": "120",
    "favorite": "90"
  },
  {
    "id": "m29",
    "categoryId": "c7",
    "title": "Cherry Ice Cream",
    "image": "assets/images/product/cherry-ice-cream.webp",
    "intro": "Delicious black cherry ice cream recipe! It's a fabulous, dark shade of magenta and has a tart flavor that kids (and adults) will love. I have been experimenting with tart cherry juice, and I love this recipe.",
    "ingredients": "1 cup heavy cream\n1 cup vanilla low-fat yogurt\n½ cup fat free milk\n¼ cup cherry juice concentrate\n1 cup frozen dark sweet cherries\n½ cup white sugar\n2 teaspoons almond extract\n1 pinch salt",
    "instructions": "Place cream, yogurt, milk, and cherry concentrate into a blender. Add cherries, sugar, almond extract, and salt. Purée until only small bits of cherries remain.\nPour mixture into a 1 1/2-quart ice cream maker and freeze according to manufacturer's instructions, about 20 minutes. Transfer to an airtight container and freeze until firm, about 4 hours.",
    "view": "192",
    "favorite": "34"
  },
  {
    "id": "m30",
    "categoryId": "c7",
    "title": "Easy, Eggless Strawberry Ice Cream",
    "image": "assets/images/product/easy-eggless-strawberry-ice-cream.webp",
    "intro": "This easy strawberry ice cream recipe doesn't use an egg-custard base but still tastes rich and creamy.",
    "ingredients": "2 cups mashed fresh strawberries\n2 cups whole milk\n2 cups heavy cream\n1 cup white sugar\n2 teaspoons vanilla extract\n¼ teaspoon salt\n2 drops red food coloring (Optional)",
    "instructions": "Combine strawberries, milk, cream, sugar, vanilla, salt, and food coloring in a large bowl.\nPour strawberry mixture into the freezer bowl of an ice cream maker; freeze according to the manufacturer's directions.",
    "view": "451",
    "favorite": "300"
  },
  {
    "id": "m31",
    "categoryId": "c7",
    "title": "Super Lemon Ice Cream",
    "image": "assets/images/product/super-lemon-ice-cream.webp",
    "intro": "This lemon ice cream is tart, tangy, and very refreshing in the summer!",
    "ingredients": "2 cups heavy whipping cream\n1 ⅛ cups white sugar\n1 cup half-and-half cream\n3 tablespoons grated lemon zest\n5 large egg yolks\n¾ cup fresh lemon juice",
    "instructions": "Combine heavy cream, sugar, half-and-half, and lemon zest in a saucepan; bring to a simmer over low heat. Cook and stir until sugar is dissolved, about 5 minutes. Remove from heat, cover the saucepan, and allow to steep for 10 minutes.\nUncover the saucepan and bring back to a simmer over low heat. Beat egg yolks in a medium bowl. Gradually whisk 1 cup hot cream mixture into eggs, several tablespoons at a time. (This brings eggs up to temperature without scrambling them.) Stir egg mixture back into cream mixture in the saucepan. Cook and stir over low heat until mixture coats the back of a spoon, 5 to 10 minutes. Transfer to a large bowl; cover and refrigerate 8 hours to overnight.\nStir lemon juice into chiled ice cream mixture. Freeze in a 4- to 5-quart ice cream maker according to manufacturer's directions. Transfer ice cream to a lidded freezer container, then freeze for about 4 hours to ripen flavors before serving.",
    "view": "130",
    "favorite": "34"
  },
  {
    "id": "m32",
    "categoryId": "c7",
    "title": "Very Chocolate Ice Cream",
    "image": "assets/images/product/very-chocolate-ice-cream.webp",
    "intro": "This chocolate ice cream is a rich, custard-style ice cream with no raw eggs!",
    "ingredients": "1 cup milk\n¾ cup sugar\n2 tablespoons unsweetened cocoa powder\n¼ teaspoon salt\n3 egg yolk, lightly beaten\n2 ounces semisweet chocolate, chopped\n2 cups heavy cream\n1 teaspoon vanilla extract",
    "instructions": "Combine milk, sugar, cocoa powder, and salt in a saucepan over medium heat. Bring to a simmer, stirring constantly.\nPlace egg yolks into a small bowl. Gradually whisk in about 1/2 cup of hot milk mixture, then return to the saucepan. Heat and stir until thickened, but do not boil.\nRemove from the heat and stir in chopped chocolate until melted.\nPour into a chilled bowl and refrigerate, stirring occasionally, until cold, about 2 hours.\nStir in cream and vanilla. Pour into an ice cream maker and freeze according to manufacturer's directions.",
    "view": "179",
    "favorite": "100"
  },
  {
    "id": "m33",
    "categoryId": "c8",
    "title": "Mango Oatmeal Breakfast Smoothie",
    "image": "assets/images/product/mango-oatmeal-breakfast-smoothie.webp",
    "intro": "A great way to start off your day! For a creamier taste, use milk in place of orange juice. You can use vanilla yogurt instead of plain yogurt, if desired.",
    "ingredients": "½ cup orange juice\n½ cup frozen mango chunks\n½ banana, cut into chunks\n⅓ cup plain yogurt\n¼ cup oats",
    "instructions": "Blend orange juice, mango, banana, yogurt, and oats together in a blender until smooth.",
    "view": "156",
    "favorite": "78"
  },
  {
    "id": "m34",
    "categoryId": "c8",
    "title": "Chocolate Sunset Smoothie",
    "image": "assets/images/product/chocolate-sunset-smoothie.webp",
    "intro": "This is a super easy but deliciously decadent drink--perfect for cooling off or relaxing on a hot summer evening. It's hard to believe that a drink this rich and creamy is dairy free!",
    "ingredients": "1 (13.5 ounce) can unsweetened coconut milk\n6 ice cubes\n¼ cup chocolate syrup",
    "instructions": "Place coconut milk, ice cubes, and chocolate syrup in a blender; blend on high speed until ice cubes are crushed. Divide between 2 serving glasses.",
    "view": "123",
    "favorite": "45"
  },
  {
    "id": "m35",
    "categoryId": "c8",
    "title": "Choconananut Smoothie",
    "image": "assets/images/product/choconananut-smoothie.webp",
    "intro": "A chocolaty, chilly soy smoothie full of healthy nutrients like protein and potassium. A tasty alternative to ice cream shakes, sure to please vegans and non-vegans alike.",
    "ingredients": "2 cups ice\n2 cups chocolate soy milk\n1 large banana\n2 tablespoons creamy peanut butter, or more to taste",
    "instructions": "Blend ice, soy milk, banana, and peanut butter together in a blender until smooth.",
    "view": "189",
    "favorite": "123"
  },
  {
    "id": "m36",
    "categoryId": "c8",
    "title": "Acai Bowl",
    "image": "assets/images/product/acai-bowl.webp",
    "intro": "Food trends typically come and go faster than we can even keep up with them. The acai bowl is a colorful trend that you've probably seen all over your Instagram feed, but it's one that seems to be here to stay — and for good reason.",
    "ingredients": "1 cup frozen acai puree, slightly thawed\n¼ cup liquid (like your milk of choice or fruit juice of choice)\n1 banana\n½ cup fruit of choice (like strawberries, blueberries, and pineapple)\nToppings:\nThese toppings are optional, so you can use what you like, but the most common acai bowl toppings are:\nGranola\nHoney\nPeanut butter or nut butter\nFresh fruit (like strawberries, blueberries, pineapple, banana, blackberries, and raspberries)\nShredded coconut\nChia seeds\nNuts\nChocolate chips",
    "instructions": "Slightly thaw the frozen acai puree, either by soaking it in warm water for a few minutes or placing it in the refrigerator overnight.\nAdd acai, your liquid of choice, banana, and any other fruits to a high-speed blender.\nBlend until all the frozen chunks are gone and the mixture is thick and smooth.\nSpoon the mixture into a bowl, top with your desired toppings, and serve immediately.",
    "view": "323",
    "favorite": "234"
  }
]
